Core/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВдокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ХарактеристикиНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") И ТипЗнч(Параметры.Отбор.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		// Если задана связь параметров выбора по значению номенклатуры,
		// то дополним параметры выбора отбором по владельцу - номенклатурной группе.
		
		Номенклатура 		  = Параметры.Отбор.Владелец;
		КатегорияНоменклатуры = Параметры.Отбор.Владелец.КатегорияНоменклатуры;
		
		ТекстСообщения = "";
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			ТекстСообщения = НСтр("ka='ნომენკლატურა არ არის შევსებული!';ru='Не заполнена номенклатура!';en='Not full range!'");
		ИначеЕсли Параметры.Свойство("ЭтоПриходныйДокумент") И Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			ТекстСообщения = НСтр("ka='გარეშე კონტრაგენტების მომსახურებებისთვის მახასიათებლების მიხედვით აღრიცხვა არ წარმოებს!';ru='Для услуг сторонних контрагентов не ведется учет по характеристикам!';en='For third-party suppliers of services do not keep records on the characteristics!'");
		ИначеЕсли НЕ Номенклатура.ИспользоватьХарактеристики Тогда
			ТекстСообщения = НСтр("ka='ნომენკლატურისთვის არ წარმოებს აღრიცხვა მახასიათებლების მიხედვით!';ru='Для номенклатуры не ведется учет по характеристикам!';en='For nomenclature not keep records on the characteristics!'");
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		МассивОтбора = Новый Массив;
		МассивОтбора.Добавить(Номенклатура);
		МассивОтбора.Добавить(КатегорияНоменклатуры);
		
		Параметры.Отбор.Вставить("Владелец", МассивОтбора);
		
	КонецЕсли;
	
	Параметры.Отбор.Вставить("ИспользуетсяВдокументах", ИСТИНА); // Kuzmich, 02.07.2021
	
КонецПроцедуры // ОбработкаПолученияДанныхВыбора()

#КонецОбласти

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
